pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2422.h
/* SYSCFG0 Control Bits */
#define PFWP                             (0x0001)        /* */
#define PFWP_L                           (0x0001)
#define PFWP_0                           (0x0000)        /* Program FRAM write enable */
#define PFWP_1                           (0x0001)        /* Program FRAM write protected (not writable) */
#define PFWP_1_L                         (0x0001)
#define DFWP                             (0x0002)        /* */
#define DFWP_L                           (0x0002)
#define DFWP_0                           (0x0000)        /* Data FRAM write enable */
#define DFWP_1                           (0x0002)        /* Data FRAM write protected (not writable) */
#define DFWP_1_L                         (0x0002)
#define FRWPPW                           (0xa500)        /* */
#define FRWPPW_H                         (0x00a5)
#define FRWPPW0                          (0x0100)        /* */
#define FRWPPW0_H                        (0x0001)
#define FRWPPW1                          (0x0200)        /* */
#define FRWPPW1_H                        (0x0002)
#define FRWPPW2                          (0x0400)        /* */
#define FRWPPW2_H                        (0x0004)
#define FRWPPW3                          (0x0800)        /* */
#define FRWPPW3_H                        (0x0008)
#define FRWPPW4                          (0x1000)        /* */
#define FRWPPW4_H                        (0x0010)
#define FRWPPW5                          (0x2000)        /* */
#define FRWPPW5_H                        (0x0020)
#define FRWPPW6                          (0x4000)        /* */
#define FRWPPW6_H                        (0x0040)
#define FRWPPW7                          (0x8000)        /* */
#define FRWPPW7_H                        (0x0080)
#define FRWPOA                           (0x00fc)        /* */
#define FRWPOA_L                         (0x00fc)
#define FRWPOA0                          (0x0004)        /* */
#define FRWPOA0_L                        (0x0004)
#define FRWPOA1                          (0x0008)        /* */
#define FRWPOA1_L                        (0x0008)
#define FRWPOA2                          (0x0010)        /* */
#define FRWPOA2_L                        (0x0010)
#define FRWPOA3                          (0x0020)        /* */
#define FRWPOA3_L                        (0x0020)
#define FRWPOA4                          (0x0040)        /* */
#define FRWPOA4_L                        (0x0040)
#define FRWPOA5                          (0x0080)        /* */
#define FRWPOA5_L                        (0x0080)

/* SYSCFG1 Control Bits */
#define IREN                             (0x0001)        /* */
#define IREN_L                           (0x0001)
#define IREN_0                           (0x0000)        /* Infrared function disabled */
#define IREN_1                           (0x0001)        /* Infrared function enabled */
#define IREN_1_L                         (0x0001)
#define IRPSEL                           (0x0002)        /* */
#define IRPSEL_L                         (0x0002)
#define IRPSEL_0                         (0x0000)        /* Normal polarity */
#define IRPSEL_1                         (0x0002)        /* Inverted polarity */
#define IRPSEL_1_L                       (0x0002)
#define IRMSEL                           (0x0004)        /* */
#define IRMSEL_L                         (0x0004)
#define IRMSEL_0                         (0x0000)        /* FSK mode */
#define IRMSEL_1                         (0x0004)        /* ASK mode */
#define IRMSEL_1_L                       (0x0004)
#define IRDSSEL                          (0x0008)        /* */
#define IRDSSEL_L                        (0x0008)
#define IRDSSEL_0                        (0x0000)        /* From hardware peripherals upon device configuration */
#define IRDSSEL_1                        (0x0008)        /* From IRDATA bit */
#define IRDSSEL_1_L                      (0x0008)
#define IRDATA                           (0x0010)        /* */
#define IRDATA_L                         (0x0010)
#define IRDATA_0                         (0x0000)        /* Infrared data logic 0 */
#define IRDATA_1                         (0x0010)        /* Infrared data logic 1 */
#define IRDATA_1_L                       (0x0010)
#define SYNCSEL                          (0x00c0)        /* */
#define SYNCSEL_L                        (0x00c0)
#define SYNCSEL0                         (0x0040)        /* */
#define SYNCSEL0_L                       (0x0040)
#define SYNCSEL1                         (0x0080)        /* */
#define SYNCSEL1_L                       (0x0080)
#define SYNCSEL_0                        (0x0000)        /* External source is selected */
#define SYNCSEL_1                        (0x0040)        /* ADC as the source is selected */
#define SYNCSEL_1_L                      (0x0040)
#define SYNCSEL_2                        (0x0080)        /* internal source is selected */
#define SYNCSEL_2_L                      (0x0080)
#define SYNCSEL_3                        (0x00c0)        /* Reserved */
#define SYNCSEL_3_L                      (0x00c0)

/* SYSCFG2 Control Bits */
#define ADCPCTL0                         (0x0001)        /* */
#define ADCPCTL0_L                       (0x0001)
#define ADCPCTL0_0                       (0x0000)        /* ADC input A0 disabled */
#define ADCPCTL0_1                       (0x0001)        /* ADC input A0 enabled */
#define ADCPCTL0_1_L                     (0x0001)
#define ADCPCTL1                         (0x0002)        /* */
#define ADCPCTL1_L                       (0x0002)
#define ADCPCTL1_0                       (0x0000)        /* ADC input A1 disabled */
#define ADCPCTL1_1                       (0x0002)        /* ADC input A1 enabled */
#define ADCPCTL1_1_L                     (0x0002)
#define ADCPCTL2                         (0x0004)        /* */
#define ADCPCTL2_L                       (0x0004)
#define ADCPCTL2_0                       (0x0000)        /* ADC input A2 disabled */
#define ADCPCTL2_1                       (0x0004)        /* ADC input A2 enabled */
#define ADCPCTL2_1_L                     (0x0004)
#define ADCPCTL3                         (0x0008)        /* */
#define ADCPCTL3_L                       (0x0008)
#define ADCPCTL3_0                       (0x0000)        /* ADC input A3 disabled */
#define ADCPCTL3_1                       (0x0008)        /* ADC input A3 enabled */
#define ADCPCTL3_1_L                     (0x0008)
#define ADCPCTL4                         (0x0010)        /* */
#define ADCPCTL4_L                       (0x0010)
#define ADCPCTL4_0                       (0x0000)        /* ADC input A4 disabled */
#define ADCPCTL4_1                       (0x0010)        /* ADC input A4 enabled */
#define ADCPCTL4_1_L                     (0x0010)
#define ADCPCTL5                         (0x0020)        /* */
#define ADCPCTL5_L                       (0x0020)
#define ADCPCTL5_0                       (0x0000)        /* ADC input A5 disabled */
#define ADCPCTL5_1                       (0x0020)        /* ADC input A5 enabled */
#define ADCPCTL5_1_L                     (0x0020)
#define ADCPCTL6                         (0x0040)        /* */
#define ADCPCTL6_L                       (0x0040)
#define ADCPCTL6_0                       (0x0000)        /* ADC input A6 disabled */
#define ADCPCTL6_1                       (0x0040)        /* ADC input A6 enabled */
#define ADCPCTL6_1_L                     (0x0040)
#define ADCPCTL7                         (0x0080)        /* */
#define ADCPCTL7_L                       (0x0080)
#define ADCPCTL7_0                       (0x0000)        /* ADC input A7 disabled */
#define ADCPCTL7_1                       (0x0080)        /* ADC input A7 enabled */
#define ADCPCTL7_1_L                     (0x0080)
#define ADCPCTL8                         (0x0100)        /* */
#define ADCPCTL8_H                       (0x0001)
#define ADCPCTL8_0                       (0x0000)        /* ADC input A8 disabled */
#define ADCPCTL8_1                       (0x0100)        /* ADC input A8 enabled */
#define ADCPCTL8_1_H                     (0x0001)
#define ADCPCTL9                         (0x0200)        /* */
#define ADCPCTL9_H                       (0x0002)
#define ADCPCTL9_0                       (0x0000)        /* ADC input A9 disabled */
#define ADCPCTL9_1                       (0x0200)        /* ADC input A9 enabled */
#define ADCPCTL9_1_H                     (0x0002)
#define USCIBRMP                         (0x0800)        /* */
#define USCIBRMP_H                       (0x0008)
#define USCIBRMP_0                       (0x0000)        /* P1.x is selected, please refer to device specific for details */
#define USCIBRMP_1                       (0x0800)        /* other port is selected, please refer to device specific for 
                                                            details */
#define USCIBRMP_1_H                     (0x0008)
#define RTCCKSEL                         (0x0400)        /* */
#define RTCCKSEL_H                       (0x0004)
#define RTC_0                            (0x0000)        /* SMCLK is selected */
#define RTC_1                            (0x0400)        /* ACLK is selected */
#define RTC_1_H                          (0x0004)
#define RTCCKSEL__RTC_SMCLK              (0x0000)        /* SMCLK is selected */
#define RTCCKSEL__RTC_ACLK               (0x0400)        /* ACLK is selected */
#define RTCCKSEL__RTC_ACLK_H             (0x0004)

