pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2422.h
#define __MSP430_HAS_TLV__                    /* Definition to show that Module is available */

#define TLV_CRC_LENGTH         (0x1A01)       /* CRC length of the TLV structure */
#define TLV_CRC_VALUE          (0x1A02)       /* CRC value of the TLV structure */
#define TLV_START              (0x1A08)       /* Start Address of the TLV structure */
#define TLV_END                (0x1AFF)       /* End Address of the TLV structure */
#define TLV_CRC_START          (0x1A04)       /* Start Address of the CRC protected structure */
#define TLV_CRC_END            (0x1AEF)       /* End Address of the TLV protected structure */

#define TLV_LDTAG              (0x01)         /*  Legacy descriptor (1xx, 2xx, 4xx families) */
#define TLV_PDTAG              (0x02)         /*  Peripheral discovery descriptor */
#define TLV_Reserved3          (0x03)         /*  Future usage */
#define TLV_Reserved4          (0x04)         /*  Future usage */
#define TLV_BLANK              (0x05)         /*  Blank descriptor */
#define TLV_Reserved6          (0x06)         /*  Future usage */
#define TLV_Reserved7          (0x07)         /*  Serial Number */
#define TLV_DIERECORD          (0x08)         /*  Die Record  */
#define TLV_ADCCAL             (0x11)         /*  ADC12 calibration */
#define TLV_ADC12CAL           (0x11)         /*  ADC12 calibration */
#define TLV_ADC10CAL           (0x13)         /*  ADC10 calibration */
#define TLV_REFCAL             (0x12)         /*  REF calibration */
#define TLV_TAGEXT             (0xFE)         /*  Tag extender */
#define TLV_TAGEND             (0xFF)         //  Tag End of Table

/************************************************************
* Interrupt Vectors (offset from 0xFF80 + 0x10 for Password)
************************************************************/

#define PORT2_VECTOR           (46)                     /* 0xFFE4 */
#define PORT1_VECTOR           (47)                     /* 0xFFE6 */
#define ADC_VECTOR             (48)                     /* 0xFFE8 */
#define EUSCI_B0_VECTOR        (49)                     /* 0xFFEA */
#define EUSCI_A0_VECTOR        (50)                     /* 0xFFEC */
#define WDT_VECTOR             (51)                     /* 0xFFEE */
#define RTC_VECTOR             (52)                     /* 0xFFF0 */
#define TIMER1_A1_VECTOR       (53)                     /* 0xFFF2 */
#define TIMER1_A0_VECTOR       (54)                     /* 0xFFF4 */
#define TIMER0_A1_VECTOR       (55)                     /* 0xFFF6 */
#define TIMER0_A0_VECTOR       (56)                     /* 0xFFF8 */
#define UNMI_VECTOR            (57)                     /* 0xFFFA */
#define SYSNMI_VECTOR          (58)                     /* 0xFFFC */
#define RESET_VECTOR           ("reset")                /* 0xFFFE Reset (Highest Priority) */


/************************************************************
* Memory Boundary Definitions
************************************************************/

#define BSL0_START              0x1000
#define BSL0_LENGTH             0x0800
#define INFO_START              0x1800
#define INFO_LENGTH             0x0100
#define RAM_START               0x2000
#define RAM_LENGTH              0x0800
#define FRAM_START              0xE300
#define FRAM_LENGTH             0x1D00
#define BSL1_START              0xFFC00
#define BSL1_LENGTH             0x0400

/************************************************************
* End of Modules
************************************************************/

#ifdef __cplusplus
}
#endif /* extern "C" */

#ifndef EXCLUDE_LEGACY
#include "legacy.h"
#endif

#endif /* #ifndef __MSP430FR2422 */


